In [23]:
import pandas as pd

In [24]:
df = pd.DataFrame(data=[['english',90],['math',80]],columns = ['class','score'])
df

     class  score
0  english     90
1     math     80

In [25]:
df = pd.DataFrame({'class':['english','math'],'score':[90,80]})
df

     class  score
0  english     90
1     math     80

In [26]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [27]:
list(df.index)

[0, 1]

In [28]:
df.index = ['A','B']
df.index

Index(['A', 'B'], dtype='object')

In [29]:
df

     class  score
A  english     90
B     math     80

In [30]:
df.set_index(keys = 'class',drop=True,append=False,inplace=True)
df

         score
class
english     90
math        80

In [31]:
df.reset_index(drop=False,inplace=True)
df

     class  score
0  english     90
1     math     80